Reports/бит_ОтчетыГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ОтчетыГЦЖС</Name>
			<Comment>Отчеты ГЦЖС</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПериода</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправляющаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыУправляющихОрганизация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизацииПоГЦЖС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоВсемЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЛьгот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаОтчета</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДляВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОДН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_ОтчетыГЦЖС/Forms/ФормаОтчетаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

Перем мВидОтчета; // Хранит текущий вид отчета.

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");
	
	Отчет.ПоВсемЛС = Истина;
	
	ВидОтчетаГЦЖСНачисленяУслуг       = Истина;
	ВидОтчетаГЦЖССыеденияОПроживающих = Ложь;
	ОтчетОВыпадающихДоходах           = Ложь;
	НадписьРасшифровка                = Ложь;
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	мКэшЗначений.мВидОтчета = "НачисленияПоЛС";
	
	мВидОтчета = "НачисленияПоЛС";
	
	Заголовок  = "Сведения о начислениях на лицевых счетах ";
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Отчет.КонецПериода = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	СтрокаКонецПериода = бит_РаботаСДиалогамиСервер.ДатаКакМесяцПредставление(Отчет.КонецПериода);
	
КонецПроцедуры

// БИТ_ЖКХ 22.07.2014
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Попытка
		ОбработкаОповещенияНаСервере(Параметр);
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаОповещенияНаСервере(Параметр)
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет,Тип("ОтчетОбъект.бит_ОтчетыГЦЖС"));
	
	Отчет.КодОрганизацииПоГЦЖС = Параметр.КодОрганизацииПоГЦЖС;
	Отчет.ИмяФайла = Параметр.ИмяФайла;
	Отчет.Формат = Параметр.Формат;
	Отчет.ПутьДляВыгрузки = Параметр.ПутьДляВыгрузки;
	
	ОтчетОбъект.Выгрузить(Параметр.КодОрганизацииПоГЦЖС,Параметр.ИмяФайла,Параметр.Формат,Параметр.ПутьДляВыгрузки,мКэшЗначений.ТаблицаОтчета);
	
	
КонецПроцедуры
// БИТ_ЖКХ 22.07.2014

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	Попытка
		СформироватьОтчетНаСервере();
	Исключение	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияВыгрузка(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяФайла",Отчет.ИмяФайла);
	ПараметрыФормы.Вставить("КодОрганизацииПоГЦЖС",Отчет.КодОрганизацииПоГЦЖС);
	ПараметрыФормы.Вставить("Формат",Отчет.Формат);
	ПараметрыФормы.Вставить("ПутьДляВыгрузки",Отчет.ПутьДляВыгрузки);
	
	ФормаПараметровСохранения = ОткрытьФорму("Отчет.бит_ОтчетыГЦЖС.Форма.НастройкаПараметровСохраненияРегламентированногоОтчетаУправляемая",ПараметрыФормы,Отчет);
	
	Если ФормаПараметровСохранения = Неопределено Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Неизвестная ошибка!");
		
		Возврат; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаГЦЖСНачисленяУслуг(Команда)
	
	ВидОтчетаГЦЖСНачисленяУслуг       = Истина;
	ВидОтчетаГЦЖССыеденияОПроживающих = Ложь;
	ОтчетОВыпадающихДоходах           = Ложь;
	НадписьРасшифровка                = Ложь;
	
	мКэшЗначений.мВидОтчета = "НачисленияПоЛС";
	Заголовок  = "Сведения о начислениях на лицевых счетах.";
	
	ОчиститьНаСервере();

	Попытка
		СформироватьОтчетНаСервере();
		
	Исключение
	КонецПопытки;
	
	УстановитьДоступность()
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтчетаГЦЖССыеденияОПроживающих(Команда)
	
	ВидОтчетаГЦЖСНачисленяУслуг       = Ложь;
	ВидОтчетаГЦЖССыеденияОПроживающих = Истина;
	ОтчетОВыпадающихДоходах           = Ложь;
	НадписьРасшифровка                = Ложь;
	
	мКэшЗначений.мВидОтчета = "СведенияОПРоживающих";
	Заголовок  = "Сведения о лицах, проживающих совместно с потребителем ";
	
	СформироватьОтчетНаСервере();
	УстановитьДоступность()
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетОВыпадающихДоходах(Команда)
	
	ВидОтчетаГЦЖСНачисленяУслуг       = Ложь;
	ВидОтчетаГЦЖССыеденияОПроживающих = Ложь;
	ОтчетОВыпадающихДоходах           = Истина;
	НадписьРасшифровка                = Ложь;
	
	мКэшЗначений.мВидОтчета = "ВыпадающиеДоходы";
	Заголовок  = "Отчет о выпадающих доходах ";
	
	СформироватьОтчетНаСервере();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасшифровка(Команда)
	
	ВидОтчетаГЦЖСНачисленяУслуг       = Ложь;
	ВидОтчетаГЦЖССыеденияОПроживающих = Ложь;
	ОтчетОВыпадающихДоходах           = Ложь;
	НадписьРасшифровка                = Истина;
	
	
	мКэшЗначений.мВидОтчета = "РасшифровкаПоЛьготе";
	Заголовок  = "Расшифровка о суммах расходов, подлежащих возмещению от пред. льгот с оплаты за КУ ";
	
	СформироватьОтчетНаСервере();
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ОчиститьНаСервере()
	
	Результат.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	Результат.Очистить();
	
	ОтчетОбъект = ДанныеФормыВЗначение(Отчет, Тип("ОтчетОбъект.бит_ОтчетыГЦЖС"));	
	
	ОтчетОбъект.СформироватьОтчет(Результат,мКэшЗначений.мВидОтчета);	
	
	Если мКэшЗначений.мВидОтчета = "НачисленияПоЛС" Тогда
		мКэшЗначений.ТаблицаОтчета =ОтчетОбъект.ТаблицаОтчета;
	КонецЕсли;	
	
КонецПроцедуры

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения  = Новый Структура; 
	
	КэшированныеЗначения.Вставить("мВидОтчета", Неопределено);
	КэшированныеЗначения.Вставить("ТаблицаОтчета", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.ПоВсемЛС.Доступность    = (мКэшЗначений.мВидОтчета = "НачисленияПоЛС");
	Элементы.Выгрузить.Доступность   = (мКэшЗначений.мВидОтчета = "НачисленияПоЛС");
	Элементы.Льгота.Видимость        =(мКэшЗначений.мВидОтчета = "РасшифровкаПоЛьготе");
	
КонецПроцедуры

#КонецОбласти
